---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.Clear
source: html/5d876de5-82b2-741f-0c4f-696e58d3cb14.htm
---
# Autodesk.Revit.DB.ExportLayerTable.Clear Method

Removes all contents stored in the table.

## Syntax (C#)
```csharp
public void Clear()
```